Revit 2027 API
ExportDGNSettings.GetActivePredefinedSettings Method
 Returns the active pre-defined non-in-session exporting settings for DGN in the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExportDGNSettings GetActivePredefinedSettings(
	Document aDoc
)
Public Shared Function GetActivePredefinedSettings (
	aDoc As Document
) As ExportDGNSettings
public:
static ExportDGNSettings^ GetActivePredefinedSettings(
	Document^ aDoc
)
static member GetActivePredefinedSettings :
        aDoc : Document -> ExportDGNSettings
Parameters
aDoc Document
 A Revit document to retrieve the active pre-defined exporting settings for DGN.
Return Value
ExportDGNSettings
 The active pre-defined exporting settings for DGN, or null if nothing pre-defined exists or the in-session settings is selected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDGNSettings Class
Autodesk.Revit.DB Namespace